## Prepinsta Winter Internship Project done by 

-> Group of two people
1. Mounika Devalamkadi - mounikahoney35@gmail.com
2. Srujana Konga - kongasrujanasujju28@gmail.com

## Import libraries

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Load dataset Daily Activity

In [2]:
df1 = pd.read_csv("C:\Prepinsta Week-8 datasets\dailyActivity_merged.csv")

In [3]:
df1

             Id ActivityDate  TotalSteps  TotalDistance  Calories
0    1503960366    4/12/2016       13162       8.500000      1985
1    1503960366    4/13/2016       10735       6.970000      1797
2    1503960366    4/14/2016       10460       6.740000      1776
3    1503960366    4/15/2016        9762       6.280000      1745
4    1503960366    4/16/2016       12669       8.160000      1863
..          ...          ...         ...            ...       ...
935  8877689391     5/8/2016       10686       8.110000      2847
936  8877689391     5/9/2016       20226      18.250000      3710
937  8877689391    5/10/2016       10733       8.150000      2832
938  8877689391    5/11/2016       21420      19.559999      3832
939  8877689391    5/12/2016        8064       6.120000      1849

[940 rows x 5 columns]

## Data Understanding

In [4]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Id             940 non-null    int64
 1   ActivityDate   940 non-null    object
 2   TotalSteps     940 non-null    int64
 3   TotalDistance  940 non-null    float64
 4   Calories       940 non-null    int64
dtypes: float64(1), int64(3), object(1)
memory usage: 36.8+ KB

In [5]:
df1.head()

           Id ActivityDate  TotalSteps  TotalDistance  Calories
0  1503960366    4/12/2016       13162           8.50      1985
1  1503960366    4/13/2016       10735           6.97      1797
2  1503960366    4/14/2016       10460           6.74      1776
3  1503960366    4/15/2016        9762           6.28      1745
4  1503960366    4/16/2016       12669           8.16      1863

In [6]:
df1.tail()

             Id ActivityDate  TotalSteps  TotalDistance  Calories
935  8877689391     5/8/2016       10686       8.110000      2847
936  8877689391     5/9/2016       20226      18.250000      3710
937  8877689391    5/10/2016       10733       8.150000      2832
938  8877689391    5/11/2016       21420      19.559999      3832
939  8877689391    5/12/2016        8064       6.120000      1849

In [7]:
df1.describe

<bound method NDFrame.describe of              Id ActivityDate  TotalSteps  TotalDistance  Calories
0    1503960366    4/12/2016       13162       8.500000      1985
1    1503960366    4/13/2016       10735       6.970000      1797
2    1503960366    4/14/2016       10460       6.740000      1776
3    1503960366    4/15/2016        9762       6.280000      1745
4    1503960366    4/16/2016       12669       8.160000      1863
..          ...          ...         ...            ...       ...
935  8877689391     5/8/2016       10686       8.110000      2847
936  8877689391     5/9/2016       20226      18.250000      3710
937  8877689391    5/10/2016       10733       8.150000      2832
938  8877689391    5/11/2016       21420      19.559999      3832
939  8877689391    5/12/2016        8064       6.120000      1849

[940 rows x 5 columns]>

In [8]:
df1.columns

Index(['Id', 'ActivityDate', 'TotalSteps', 'TotalDistance', 'Calories'], dtype='object')

In [9]:
df1

             Id ActivityDate  TotalSteps  TotalDistance  Calories
0    1503960366    4/12/2016       13162       8.500000      1985
1    1503960366    4/13/2016       10735       6.970000      1797
2    1503960366    4/14/2016       10460       6.740000      1776
3    1503960366    4/15/2016        9762       6.280000      1745
4    1503960366    4/16/2016       12669       8.160000      1863
..          ...          ...         ...            ...       ...
935  8877689391     5/8/2016       10686       8.110000      2847
936  8877689391     5/9/2016       20226      18.250000      3710
937  8877689391    5/10/2016       10733       8.150000      2832
938  8877689391    5/11/2016       21420      19.559999      3832
939  8877689391    5/12/2016        8064       6.120000      1849

[940 rows x 5 columns]

In [10]:
df1.to_csv("C:\Prepinsta Week-8 datasets\dailyActivity_merged.csv",index=False)

In [11]:
df1['ActivityDate'] = pd.to_datetime(df1['ActivityDate'])

In [12]:
df1['ActivityDate'] = df1['ActivityDate'].dt.strftime('%m/%d/%Y %I:%M:%S %p')

In [13]:
df1

             Id            ActivityDate  TotalSteps  TotalDistance  Calories
0    1503960366  04/12/2016 12:00:00 AM       13162       8.500000      1985
1    1503960366  04/13/2016 12:00:00 AM       10735       6.970000      1797
2    1503960366  04/14/2016 12:00:00 AM       10460       6.740000      1776
3    1503960366  04/15/2016 12:00:00 AM        9762       6.280000      1745
4    1503960366  04/16/2016 12:00:00 AM       12669       8.160000      1863
..          ...                     ...         ...            ...       ...
935  8877689391  05/08/2016 12:00:00 AM       10686       8.110000      2847
936  8877689391  05/09/2016 12:00:00 AM       20226      18.250000      3710
937  8877689391  05/10/2016 12:00:00 AM       10733       8.150000      2832
938  8877689391  05/11/2016 12:00:00 AM       21420      19.559999      3832
939  8877689391  05/12/2016 12:00:00 AM        8064       6.120000      1849

[940 rows x 5 columns]

In [14]:
df1.rename(columns={'ActivityDate': 'Date'}, inplace=True)

In [15]:
df1

             Id                    Date  TotalSteps  TotalDistance  Calories
0    1503960366  04/12/2016 12:00:00 AM       13162       8.500000      1985
1    1503960366  04/13/2016 12:00:00 AM       10735       6.970000      1797
2    1503960366  04/14/2016 12:00:00 AM       10460       6.740000      1776
3    1503960366  04/15/2016 12:00:00 AM        9762       6.280000      1745
4    1503960366  04/16/2016 12:00:00 AM       12669       8.160000      1863
..          ...                     ...         ...            ...       ...
935  8877689391  05/08/2016 12:00:00 AM       10686       8.110000      2847
936  8877689391  05/09/2016 12:00:00 AM       20226      18.250000      3710
937  8877689391  05/10/2016 12:00:00 AM       10733       8.150000      2832
938  8877689391  05/11/2016 12:00:00 AM       21420      19.559999      3832
939  8877689391  05/12/2016 12:00:00 AM        8064       6.120000      1849

[940 rows x 5 columns]

In [16]:
df1['Id'].value_counts()

Id
1503960366    31
4319703577    31
8583815059    31
8378563200    31
8053475328    31
7086361926    31
6962181067    31
5553957443    31
4702921684    31
4558609924    31
1624580081    31
4388161847    31
4445114986    31
8877689391    31
1927972279    31
2873212765    31
2320127002    31
4020332650    31
2026352035    31
1844505072    31
2022484408    31
3977333714    30
1644430081    30
5577150313    30
8792009665    29
6290855005    29
6117666160    28
6775888955    26
7007744171    26
3372868164    20
8253242879    19
2347167796    18
4057192912     4
Name: count, dtype: int64

## Data types

In [17]:
df1.dtypes

Id                 int64
Date              object
TotalSteps         int64
TotalDistance    float64
Calories           int64
dtype: object

In [18]:
df1['Date'] = pd.to_datetime(df1['Date'], format='%m/%d/%Y %I:%M:%S %p')

In [19]:
df1.shape

(940, 5)

## Missing Values

In [20]:
df1.isna().sum()

Id               0
Date             0
TotalSteps       0
TotalDistance    0
Calories         0
dtype: int64

## Load Dataset Daily Calories

In [21]:
df2 = pd.read_csv("C:\Prepinsta Week-8 datasets\dailyCalories_merged.csv")

In [22]:
df2

             Id ActivityDay  Calories
0    1503960366   4/12/2016      1985
1    1503960366   4/13/2016      1797
2    1503960366   4/14/2016      1776
3    1503960366   4/15/2016      1745
4    1503960366   4/16/2016      1863
..          ...         ...       ...
935  8877689391    5/8/2016      2847
936  8877689391    5/9/2016      3710
937  8877689391   5/10/2016      2832
938  8877689391   5/11/2016      3832
939  8877689391   5/12/2016      1849

[940 rows x 3 columns]

## Data Understanding

In [23]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Id           940 non-null    int64
 1   ActivityDay  940 non-null    object
 2   Calories     940 non-null    int64
dtypes: int64(2), object(1)
memory usage: 22.2+ KB

In [24]:
df2.describe

<bound method NDFrame.describe of              Id ActivityDay  Calories
0    1503960366   4/12/2016      1985
1    1503960366   4/13/2016      1797
2    1503960366   4/14/2016      1776
3    1503960366   4/15/2016      1745
4    1503960366   4/16/2016      1863
..          ...         ...       ...
935  8877689391    5/8/2016      2847
936  8877689391    5/9/2016      3710
937  8877689391   5/10/2016      2832
938  8877689391   5/11/2016      3832
939  8877689391   5/12/2016      1849

[940 rows x 3 columns]>

In [25]:
df2.head()

           Id ActivityDay  Calories
0  1503960366   4/12/2016      1985
1  1503960366   4/13/2016      1797
2  1503960366   4/14/2016      1776
3  1503960366   4/15/2016      1745
4  1503960366   4/16/2016      1863

In [26]:
df2.tail()

             Id ActivityDay  Calories
935  8877689391    5/8/2016      2847
936  8877689391    5/9/2016      3710
937  8877689391   5/10/2016      2832
938  8877689391   5/11/2016      3832
939  8877689391   5/12/2016      1849

In [27]:
df2.shape

(940, 3)

In [28]:
df2['Id'].value_counts().count()

33

## Data types

In [29]:
df2.dtypes

Id              int64
ActivityDay    object
Calories        int64
dtype: object

In [30]:
df2['ActivityDay'] = pd.to_datetime(df2['ActivityDay'])

In [31]:
df2.rename(columns = {'ActivityDay':'ActivityDate'}, inplace = True)

## Missing Values

In [32]:
df2.isna().sum()

Id              0
ActivityDate    0
Calories        0
dtype: int64

## Load dataset Daily Intensities

In [33]:
df3 = pd.read_csv("C:\Prepinsta Week-8 datasets\dailyIntensities_merged.csv")

In [34]:
df3

,Id,ActivityDay,SedentaryMinutes,LightlyActiveMinutes,FairlyActiveMinutes,VeryActiveMinutes,SedentaryActiveDistance,LightActiveDistance,ModeratelyActiveDistance,VeryActiveDistance
0,1503960366,4/12/2016,728,328,13,25,0.00,6.06,0.55,1.88
1,1503960366,4/13/2016,776,217,19,21,0.00,4.71,0.69,1.57
2,1503960366,4/14/2016,1218,181,11,30,0.00,3.91,0.40,2.44
3,1503960366,4/15/2016,726,209,34,29,0.00,2.83,1.26,2.14
4,1503960366,4/16/2016,773,221,10,36,0.00,5.04,0.41,2.71
...,...,...,...,...,...,...,...,...,...,...
935,8877689391,5/8/2016,1174,245,4,17,0.00,6.80,0.20,1.08
936,8877689391,5/9/2016,1131,217,19,73,0.05,6.24,0.80,11.10
937,8877689391,5/10/2016,1187,224,11,18,0.00,6.28,0.46,1.35
938,8877689391,5/11/2016,1127,213,12,88,0.00,5.89,0.41,13.22
939,8877689391,5/12/2016,770,137,1,23,0.00,4.25,0.04,1.82

## Data Understanding

In [35]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 10 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Id                        940 non-null    int64
 1   ActivityDay               940 non-null    object
 2   SedentaryMinutes          940 non-null    int64
 3   LightlyActiveMinutes      940 non-null    int64
 4   FairlyActiveMinutes       940 non-null    int64
 5   VeryActiveMinutes         940 non-null    int64
 6   SedentaryActiveDistance   940 non-null    float64
 7   LightActiveDistance       940 non-null    float64
 8   ModeratelyActiveDistance  940 non-null    float64
 9   VeryActiveDistance        940 non-null    float64
dtypes: float64(4), int64(5), object(1)
memory usage: 73.6+ KB

In [36]:
df3.head()

,Id,ActivityDay,SedentaryMinutes,LightlyActiveMinutes,FairlyActiveMinutes,VeryActiveMinutes,SedentaryActiveDistance,LightActiveDistance,ModeratelyActiveDistance,VeryActiveDistance
0,1503960366,4/12/2016,728,328,13,25,0.0,6.06,0.55,1.88
1,1503960366,4/13/2016,776,217,19,21,0.0,4.71,0.69,1.57
2,1503960366,4/14/2016,1218,181,11,30,0.0,3.91,0.40,2.44
3,1503960366,4/15/2016,726,209,34,29,0.0,2.83,1.26,2.14
4,1503960366,4/16/2016,773,221,10,36,0.0,5.04,0.41,2.71

In [37]:
df3.tail()

,Id,ActivityDay,SedentaryMinutes,LightlyActiveMinutes,FairlyActiveMinutes,VeryActiveMinutes,SedentaryActiveDistance,LightActiveDistance,ModeratelyActiveDistance,VeryActiveDistance
935,8877689391,5/8/2016,1174,245,4,17,0.00,6.80,0.20,1.08
936,8877689391,5/9/2016,1131,217,19,73,0.05,6.24,0.80,11.10
937,8877689391,5/10/2016,1187,224,11,18,0.00,6.28,0.46,1.35
938,8877689391,5/11/2016,1127,213,12,88,0.00,5.89,0.41,13.22
939,8877689391,5/12/2016,770,137,1,23,0.00,4.25,0.04,1.82

In [38]:
df3.describe()

,Id,SedentaryMinutes,LightlyActiveMinutes,FairlyActiveMinutes,VeryActiveMinutes,SedentaryActiveDistance,LightActiveDistance,ModeratelyActiveDistance,VeryActiveDistance
count,9.400000e+02,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000,940.000000
mean,4.855407e+09,991.210638,192.812766,13.564894,21.164894,0.001606,3.340819,0.567543,1.502681
std,2.424805e+09,301.267437,109.174700,19.987404,32.844803,0.007346,2.040655,0.883580,2.658941
min,1.503960e+09,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.320127e+09,729.750000,127.000000,0.000000,0.000000,0.000000,1.945000,0.000000,0.000000
50%,4.445115e+09,1057.500000,199.000000,6.000000,4.000000,0.000000,3.365000,0.240000,0.210000
75%,6.962181e+09,1229.500000,264.000000,19.000000,32.000000,0.000000,4.782500,0.800000,2.052500
max,8.877689e+09,1440.000000,518.000000,143.000000,210.000000,0.110000,10.710000,6.480000,21.920000

In [39]:
df3.shape

(940, 10)

## Data types

In [40]:
df3.dtypes

Id                            int64
ActivityDay                  object
SedentaryMinutes              int64
LightlyActiveMinutes          int64
FairlyActiveMinutes           int64
VeryActiveMinutes             int64
SedentaryActiveDistance     float64
LightActiveDistance         float64
ModeratelyActiveDistance    float64
VeryActiveDistance          float64
dtype: object

## Missing Values

In [41]:
df3.isna().sum()

Id                          0
ActivityDay                 0
SedentaryMinutes            0
LightlyActiveMinutes        0
FairlyActiveMinutes         0
VeryActiveMinutes           0
SedentaryActiveDistance     0
LightActiveDistance         0
ModeratelyActiveDistance    0
VeryActiveDistance          0
dtype: int64

## Load Dataset Daily Steps

In [42]:
df4 = pd.read_csv("C:\Prepinsta Week-8 datasets\dailySteps_merged.csv")

In [43]:
df4

             Id ActivityDay  StepTotal
0    1503960366   4/12/2016      13162
1    1503960366   4/13/2016      10735
2    1503960366   4/14/2016      10460
3    1503960366   4/15/2016       9762
4    1503960366   4/16/2016      12669
..          ...         ...        ...
935  8877689391    5/8/2016      10686
936  8877689391    5/9/2016      20226
937  8877689391   5/10/2016      10733
938  8877689391   5/11/2016      21420
939  8877689391   5/12/2016       8064

[940 rows x 3 columns]

## Data understanding

In [44]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 940 entries, 0 to 939
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Id           940 non-null    int64
 1   ActivityDay  940 non-null    object
 2   StepTotal    940 non-null    int64
dtypes: int64(2), object(1)
memory usage: 22.2+ KB

In [45]:
df4.describe()

                 Id     StepTotal
count  9.400000e+02    940.000000
mean   4.855407e+09   7637.910638
std    2.424805e+09   5087.150742
min    1.503960e+09      0.000000
25%    2.320127e+09   3789.750000
50%    4.445115e+09   7405.500000
75%    6.962181e+09  10727.000000
max    8.877689e+09  36019.000000

In [46]:
df4.head()

           Id ActivityDay  StepTotal
0  1503960366   4/12/2016      13162
1  1503960366   4/13/2016      10735
2  1503960366   4/14/2016      10460
3  1503960366   4/15/2016       9762
4  1503960366   4/16/2016      12669

In [47]:
df4.tail()

             Id ActivityDay  StepTotal
935  8877689391    5/8/2016      10686
936  8877689391    5/9/2016      20226
937  8877689391   5/10/2016      10733
938  8877689391   5/11/2016      21420
939  8877689391   5/12/2016       8064

In [48]:
df4.shape

(940, 3)

## Data types

In [49]:
df4.dtypes

Id              int64
ActivityDay    object
StepTotal       int64
dtype: object

## Missing Values

In [50]:
df4.isna().sum()

Id             0
ActivityDay    0
StepTotal      0
dtype: int64

## Load dataset Hourly Calories

In [51]:
df5 = pd.read_csv("C:\Prepinsta Week-8 datasets\hourlyCalories_merged.csv")

In [52]:
df5

               Id           ActivityHour  Calories
0      1503960366  4/12/2016 12:00:00 AM        81
1      1503960366   4/12/2016 1:00:00 AM        61
2      1503960366   4/12/2016 2:00:00 AM        59
3      1503960366   4/12/2016 3:00:00 AM        47
4      1503960366   4/12/2016 4:00:00 AM        48
...           ...                    ...       ...
22094  8877689391  5/12/2016 10:00:00 AM       126
22095  8877689391  5/12/2016 11:00:00 AM       192
22096  8877689391  5/12/2016 12:00:00 PM       321
22097  8877689391   5/12/2016 1:00:00 PM       101
22098  8877689391   5/12/2016 2:00:00 PM       113

[22099 rows x 3 columns]

## Data Understanding

In [53]:
df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            22099 non-null  int64
 1   ActivityHour  22099 non-null  object
 2   Calories      22099 non-null  int64
dtypes: int64(2), object(1)
memory usage: 518.1+ KB

In [54]:
df5.head()

           Id           ActivityHour  Calories
0  1503960366  4/12/2016 12:00:00 AM        81
1  1503960366   4/12/2016 1:00:00 AM        61
2  1503960366   4/12/2016 2:00:00 AM        59
3  1503960366   4/12/2016 3:00:00 AM        47
4  1503960366   4/12/2016 4:00:00 AM        48

In [55]:
df5.tail()

               Id           ActivityHour  Calories
22094  8877689391  5/12/2016 10:00:00 AM       126
22095  8877689391  5/12/2016 11:00:00 AM       192
22096  8877689391  5/12/2016 12:00:00 PM       321
22097  8877689391   5/12/2016 1:00:00 PM       101
22098  8877689391   5/12/2016 2:00:00 PM       113

In [56]:
df5.describe()

                 Id      Calories
count  2.209900e+04  22099.000000
mean   4.848235e+09     97.386760
std    2.422500e+09     60.702622
min    1.503960e+09     42.000000
25%    2.320127e+09     63.000000
50%    4.445115e+09     83.000000
75%    6.962181e+09    108.000000
max    8.877689e+09    948.000000

In [57]:
df5.shape

(22099, 3)

## Data types

In [58]:
df5.dtypes

Id               int64
ActivityHour    object
Calories         int64
dtype: object

## Missing Values

In [59]:
df5.isna().sum()

Id              0
ActivityHour    0
Calories        0
dtype: int64

## Load Dataset Hourly Intensities

In [60]:
df6 = pd.read_csv("C:\Prepinsta Week-8 datasets\hourlyIntensities_merged.csv")

In [61]:
df6

               Id           ActivityHour  TotalIntensity  AverageIntensity
0      1503960366  4/12/2016 12:00:00 AM              20          0.333333
1      1503960366   4/12/2016 1:00:00 AM               8          0.133333
2      1503960366   4/12/2016 2:00:00 AM               7          0.116667
3      1503960366   4/12/2016 3:00:00 AM               0          0.000000
4      1503960366   4/12/2016 4:00:00 AM               0          0.000000
...           ...                    ...             ...               ...
22094  8877689391  5/12/2016 10:00:00 AM              12          0.200000
22095  8877689391  5/12/2016 11:00:00 AM              29          0.483333
22096  8877689391  5/12/2016 12:00:00 PM              93          1.550000
22097  8877689391   5/12/2016 1:00:00 PM               6          0.100000
22098  8877689391   5/12/2016 2:00:00 PM               9          0.150000

[22099 rows x 4 columns]

## Data understanding

In [62]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Id                22099 non-null  int64
 1   ActivityHour      22099 non-null  object
 2   TotalIntensity    22099 non-null  int64
 3   AverageIntensity  22099 non-null  float64
dtypes: float64(1), int64(2), object(1)
memory usage: 690.7+ KB

In [63]:
df6.head()

           Id           ActivityHour  TotalIntensity  AverageIntensity
0  1503960366  4/12/2016 12:00:00 AM              20          0.333333
1  1503960366   4/12/2016 1:00:00 AM               8          0.133333
2  1503960366   4/12/2016 2:00:00 AM               7          0.116667
3  1503960366   4/12/2016 3:00:00 AM               0          0.000000
4  1503960366   4/12/2016 4:00:00 AM               0          0.000000

In [64]:
df6.tail()

               Id           ActivityHour  TotalIntensity  AverageIntensity
22094  8877689391  5/12/2016 10:00:00 AM              12          0.200000
22095  8877689391  5/12/2016 11:00:00 AM              29          0.483333
22096  8877689391  5/12/2016 12:00:00 PM              93          1.550000
22097  8877689391   5/12/2016 1:00:00 PM               6          0.100000
22098  8877689391   5/12/2016 2:00:00 PM               9          0.150000

In [65]:
df6.describe()

                 Id  TotalIntensity  AverageIntensity
count  2.209900e+04    22099.000000      22099.000000
mean   4.848235e+09       12.035341          0.200589
std    2.422500e+09       21.133110          0.352219
min    1.503960e+09        0.000000          0.000000
25%    2.320127e+09        0.000000          0.000000
50%    4.445115e+09        3.000000          0.050000
75%    6.962181e+09       16.000000          0.266667
max    8.877689e+09      180.000000          3.000000

In [66]:
df6.shape

(22099, 4)

## Data types

In [67]:
df6.dtypes

Id                    int64
ActivityHour         object
TotalIntensity        int64
AverageIntensity    float64
dtype: object

In [68]:
df6.columns

Index(['Id', 'ActivityHour', 'TotalIntensity', 'AverageIntensity'], dtype='object')

## Missing Values

In [69]:
df6.isna().sum()

Id                  0
ActivityHour        0
TotalIntensity      0
AverageIntensity    0
dtype: int64

## Merge Hourly Calories and Hourly Intensities

In [70]:
hrly_cal_int_merged = pd.merge(df5, df6 , on = ['Id','ActivityHour'])
hrly_cal_int_merged

,Id,ActivityHour,Calories,TotalIntensity,AverageIntensity
0,1503960366,4/12/2016 12:00:00 AM,81,20,0.333333
1,1503960366,4/12/2016 1:00:00 AM,61,8,0.133333
2,1503960366,4/12/2016 2:00:00 AM,59,7,0.116667
3,1503960366,4/12/2016 3:00:00 AM,47,0,0.000000
4,1503960366,4/12/2016 4:00:00 AM,48,0,0.000000
...,...,...,...,...,...
22094,8877689391,5/12/2016 10:00:00 AM,126,12,0.200000
22095,8877689391,5/12/2016 11:00:00 AM,192,29,0.483333
22096,8877689391,5/12/2016 12:00:00 PM,321,93,1.550000
22097,8877689391,5/12/2016 1:00:00 PM,101,6,0.100000
22098,8877689391,5/12/2016 2:00:00 PM,113,9,0.150000

## Load dataset Hourly steps

In [71]:
df7 = pd.read_csv("C:\Prepinsta Week-8 datasets\hourlySteps_merged.csv")

In [72]:
df7

               Id           ActivityHour  StepTotal
0      1503960366  4/12/2016 12:00:00 AM        373
1      1503960366   4/12/2016 1:00:00 AM        160
2      1503960366   4/12/2016 2:00:00 AM        151
3      1503960366   4/12/2016 3:00:00 AM          0
4      1503960366   4/12/2016 4:00:00 AM          0
...           ...                    ...        ...
22094  8877689391  5/12/2016 10:00:00 AM        514
22095  8877689391  5/12/2016 11:00:00 AM       1407
22096  8877689391  5/12/2016 12:00:00 PM       3135
22097  8877689391   5/12/2016 1:00:00 PM        307
22098  8877689391   5/12/2016 2:00:00 PM        457

[22099 rows x 3 columns]

## Data Understanding

In [73]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22099 entries, 0 to 22098
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Id            22099 non-null  int64
 1   ActivityHour  22099 non-null  object
 2   StepTotal     22099 non-null  int64
dtypes: int64(2), object(1)
memory usage: 518.1+ KB

In [74]:
df7.head()

           Id           ActivityHour  StepTotal
0  1503960366  4/12/2016 12:00:00 AM        373
1  1503960366   4/12/2016 1:00:00 AM        160
2  1503960366   4/12/2016 2:00:00 AM        151
3  1503960366   4/12/2016 3:00:00 AM          0
4  1503960366   4/12/2016 4:00:00 AM          0

In [75]:
df7.tail()

               Id           ActivityHour  StepTotal
22094  8877689391  5/12/2016 10:00:00 AM        514
22095  8877689391  5/12/2016 11:00:00 AM       1407
22096  8877689391  5/12/2016 12:00:00 PM       3135
22097  8877689391   5/12/2016 1:00:00 PM        307
22098  8877689391   5/12/2016 2:00:00 PM        457

In [76]:
df7.describe

<bound method NDFrame.describe of                Id           ActivityHour  StepTotal
0      1503960366  4/12/2016 12:00:00 AM        373
1      1503960366   4/12/2016 1:00:00 AM        160
2      1503960366   4/12/2016 2:00:00 AM        151
3      1503960366   4/12/2016 3:00:00 AM          0
4      1503960366   4/12/2016 4:00:00 AM          0
...           ...                    ...        ...
22094  8877689391  5/12/2016 10:00:00 AM        514
22095  8877689391  5/12/2016 11:00:00 AM       1407
22096  8877689391  5/12/2016 12:00:00 PM       3135
22097  8877689391   5/12/2016 1:00:00 PM        307
22098  8877689391   5/12/2016 2:00:00 PM        457

[22099 rows x 3 columns]>

In [77]:
df7.shape

(22099, 3)

In [78]:
df7.columns

Index(['Id', 'ActivityHour', 'StepTotal'], dtype='object')

## Data types

In [79]:
df7.dtypes

Id               int64
ActivityHour    object
StepTotal        int64
dtype: object

## Missing Values

In [80]:
df7.isna().sum()

Id              0
ActivityHour    0
StepTotal       0
dtype: int64

## Merge Hrly_cal_int_merged (hourly calories and hourly intensities) and Hourly steps

In [81]:
hrly_activity_merged = pd.merge(hrly_cal_int_merged, df7, on = ['Id','ActivityHour'])
hrly_activity_merged

,Id,ActivityHour,Calories,TotalIntensity,AverageIntensity,StepTotal
0,1503960366,4/12/2016 12:00:00 AM,81,20,0.333333,373
1,1503960366,4/12/2016 1:00:00 AM,61,8,0.133333,160
2,1503960366,4/12/2016 2:00:00 AM,59,7,0.116667,151
3,1503960366,4/12/2016 3:00:00 AM,47,0,0.000000,0
4,1503960366,4/12/2016 4:00:00 AM,48,0,0.000000,0
...,...,...,...,...,...,...
22094,8877689391,5/12/2016 10:00:00 AM,126,12,0.200000,514
22095,8877689391,5/12/2016 11:00:00 AM,192,29,0.483333,1407
22096,8877689391,5/12/2016 12:00:00 PM,321,93,1.550000,3135
22097,8877689391,5/12/2016 1:00:00 PM,101,6,0.100000,307
22098,8877689391,5/12/2016 2:00:00 PM,113,9,0.150000,457

## Save hrly_activity_merged csv file

In [82]:
hrly_activity_merged.to_csv(r"C:\Prepinsta week-8 datasets\houlyActivity_merged.csv", index = False)

## Load dataset Minute Calories Narrow

In [83]:
df8 = pd.read_csv("C:\Prepinsta Week-8 datasets\minuteCaloriesNarrow_merged.csv")

In [84]:
df8

                 Id         ActivityMinute  Calories
0        1503960366  4/12/2016 12:00:00 AM   0.78650
1        1503960366  4/12/2016 12:01:00 AM   0.78650
2        1503960366  4/12/2016 12:02:00 AM   0.78650
3        1503960366  4/12/2016 12:03:00 AM   0.78650
4        1503960366  4/12/2016 12:04:00 AM   0.78650
...             ...                    ...       ...
1325575  8877689391   5/12/2016 1:55:00 PM   1.33353
1325576  8877689391   5/12/2016 1:56:00 PM   1.33353
1325577  8877689391   5/12/2016 1:57:00 PM   1.33353
1325578  8877689391   5/12/2016 1:58:00 PM   1.33353
1325579  8877689391   5/12/2016 1:59:00 PM   1.33353

[1325580 rows x 3 columns]

## Data Understanding

In [85]:
df8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   Calories        1325580 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 30.3+ MB

In [86]:
df8.head()

           Id         ActivityMinute  Calories
0  1503960366  4/12/2016 12:00:00 AM    0.7865
1  1503960366  4/12/2016 12:01:00 AM    0.7865
2  1503960366  4/12/2016 12:02:00 AM    0.7865
3  1503960366  4/12/2016 12:03:00 AM    0.7865
4  1503960366  4/12/2016 12:04:00 AM    0.7865

In [87]:
df8.tail()

                 Id        ActivityMinute  Calories
1325575  8877689391  5/12/2016 1:55:00 PM   1.33353
1325576  8877689391  5/12/2016 1:56:00 PM   1.33353
1325577  8877689391  5/12/2016 1:57:00 PM   1.33353
1325578  8877689391  5/12/2016 1:58:00 PM   1.33353
1325579  8877689391  5/12/2016 1:59:00 PM   1.33353

In [88]:
df8.describe()

                 Id      Calories
count  1.325580e+06  1.325580e+06
mean   4.847898e+09  1.623130e+00
std    2.422313e+09  1.410447e+00
min    1.503960e+09  0.000000e+00
25%    2.320127e+09  9.357000e-01
50%    4.445115e+09  1.217600e+00
75%    6.962181e+09  1.432700e+00
max    8.877689e+09  1.974995e+01

In [89]:
df8.shape

(1325580, 3)

In [90]:
df8.columns

Index(['Id', 'ActivityMinute', 'Calories'], dtype='object')

## Data types

In [91]:
df8.dtypes

Id                  int64
ActivityMinute     object
Calories          float64
dtype: object

## Missing Values

In [92]:
df8.isna().sum()

Id                0
ActivityMinute    0
Calories          0
dtype: int64

## Load dataset Minute Steps Narrow

In [93]:
df9 = pd.read_csv("C:\Prepinsta Week-8 datasets\minuteStepsNarrow_merged.csv")

In [94]:
df9

                 Id         ActivityMinute  Steps
0        1503960366  4/12/2016 12:00:00 AM      0
1        1503960366  4/12/2016 12:01:00 AM      0
2        1503960366  4/12/2016 12:02:00 AM      0
3        1503960366  4/12/2016 12:03:00 AM      0
4        1503960366  4/12/2016 12:04:00 AM      0
...             ...                    ...    ...
1325575  8877689391   5/12/2016 1:55:00 PM      0
1325576  8877689391   5/12/2016 1:56:00 PM      0
1325577  8877689391   5/12/2016 1:57:00 PM      0
1325578  8877689391   5/12/2016 1:58:00 PM      0
1325579  8877689391   5/12/2016 1:59:00 PM      0

[1325580 rows x 3 columns]

## Data Understanding

In [95]:
df9.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   Steps           1325580 non-null  int64
dtypes: int64(2), object(1)
memory usage: 30.3+ MB

In [96]:
df9.head()

           Id         ActivityMinute  Steps
0  1503960366  4/12/2016 12:00:00 AM      0
1  1503960366  4/12/2016 12:01:00 AM      0
2  1503960366  4/12/2016 12:02:00 AM      0
3  1503960366  4/12/2016 12:03:00 AM      0
4  1503960366  4/12/2016 12:04:00 AM      0

In [97]:
df9.tail()

                 Id        ActivityMinute  Steps
1325575  8877689391  5/12/2016 1:55:00 PM      0
1325576  8877689391  5/12/2016 1:56:00 PM      0
1325577  8877689391  5/12/2016 1:57:00 PM      0
1325578  8877689391  5/12/2016 1:58:00 PM      0
1325579  8877689391  5/12/2016 1:59:00 PM      0

In [98]:
df9.shape

(1325580, 3)

In [99]:
df9.columns

Index(['Id', 'ActivityMinute', 'Steps'], dtype='object')

In [100]:
df9.describe()

                 Id         Steps
count  1.325580e+06  1.325580e+06
mean   4.847898e+09  5.336192e+00
std    2.422313e+09  1.812830e+01
min    1.503960e+09  0.000000e+00
25%    2.320127e+09  0.000000e+00
50%    4.445115e+09  0.000000e+00
75%    6.962181e+09  0.000000e+00
max    8.877689e+09  2.200000e+02

## Data types

In [101]:
df9.dtypes

Id                 int64
ActivityMinute    object
Steps              int64
dtype: object

## Missing Values

In [102]:
df9.isna().sum()

Id                0
ActivityMinute    0
Steps             0
dtype: int64

## Merge Minute Calories Narrow and Minute Steps Narrow

In [103]:
min_cal_step_merged = pd.merge(df8,df9, on=['Id','ActivityMinute'])
min_cal_step_merged

                 Id         ActivityMinute  Calories  Steps
0        1503960366  4/12/2016 12:00:00 AM   0.78650      0
1        1503960366  4/12/2016 12:01:00 AM   0.78650      0
2        1503960366  4/12/2016 12:02:00 AM   0.78650      0
3        1503960366  4/12/2016 12:03:00 AM   0.78650      0
4        1503960366  4/12/2016 12:04:00 AM   0.78650      0
...             ...                    ...       ...    ...
1325575  8877689391   5/12/2016 1:55:00 PM   1.33353      0
1325576  8877689391   5/12/2016 1:56:00 PM   1.33353      0
1325577  8877689391   5/12/2016 1:57:00 PM   1.33353      0
1325578  8877689391   5/12/2016 1:58:00 PM   1.33353      0
1325579  8877689391   5/12/2016 1:59:00 PM   1.33353      0

[1325580 rows x 4 columns]

## Load dataset Minute Intensities Narrow

In [104]:
df10= pd.read_csv("C:\Prepinsta Week-8 datasets\minuteIntensitiesNarrow_merged.csv")

In [105]:
df10

                 Id         ActivityMinute  Intensity
0        1503960366  4/12/2016 12:00:00 AM          0
1        1503960366  4/12/2016 12:01:00 AM          0
2        1503960366  4/12/2016 12:02:00 AM          0
3        1503960366  4/12/2016 12:03:00 AM          0
4        1503960366  4/12/2016 12:04:00 AM          0
...             ...                    ...        ...
1325575  8877689391   5/12/2016 1:55:00 PM          0
1325576  8877689391   5/12/2016 1:56:00 PM          0
1325577  8877689391   5/12/2016 1:57:00 PM          0
1325578  8877689391   5/12/2016 1:58:00 PM          0
1325579  8877689391   5/12/2016 1:59:00 PM          0

[1325580 rows x 3 columns]

## Data understanding

In [106]:
df10.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   Intensity       1325580 non-null  int64
dtypes: int64(2), object(1)
memory usage: 30.3+ MB

In [107]:
df10.head()

           Id         ActivityMinute  Intensity
0  1503960366  4/12/2016 12:00:00 AM          0
1  1503960366  4/12/2016 12:01:00 AM          0
2  1503960366  4/12/2016 12:02:00 AM          0
3  1503960366  4/12/2016 12:03:00 AM          0
4  1503960366  4/12/2016 12:04:00 AM          0

In [108]:
df10.tail()

                 Id        ActivityMinute  Intensity
1325575  8877689391  5/12/2016 1:55:00 PM          0
1325576  8877689391  5/12/2016 1:56:00 PM          0
1325577  8877689391  5/12/2016 1:57:00 PM          0
1325578  8877689391  5/12/2016 1:58:00 PM          0
1325579  8877689391  5/12/2016 1:59:00 PM          0

In [109]:
df10.describe()

                 Id     Intensity
count  1.325580e+06  1.325580e+06
mean   4.847898e+09  2.005937e-01
std    2.422313e+09  5.190227e-01
min    1.503960e+09  0.000000e+00
25%    2.320127e+09  0.000000e+00
50%    4.445115e+09  0.000000e+00
75%    6.962181e+09  0.000000e+00
max    8.877689e+09  3.000000e+00

In [110]:
df10.shape

(1325580, 3)

In [111]:
df10.columns

Index(['Id', 'ActivityMinute', 'Intensity'], dtype='object')

## Data types

In [112]:
df10.dtypes

Id                 int64
ActivityMinute    object
Intensity          int64
dtype: object

## Missing values

In [113]:
df10.isna().sum()

Id                0
ActivityMinute    0
Intensity         0
dtype: int64

## Merge min_cal_step_merged (Minute Calories Narrow and Minute Steps Narrow) and Minute Intensities Narrow

In [114]:
min_cal_step_int_merged = pd.merge(min_cal_step_merged,df10, on = ['Id','ActivityMinute'])
min_cal_step_int_merged

                 Id         ActivityMinute  Calories  Steps  Intensity
0        1503960366  4/12/2016 12:00:00 AM   0.78650      0          0
1        1503960366  4/12/2016 12:01:00 AM   0.78650      0          0
2        1503960366  4/12/2016 12:02:00 AM   0.78650      0          0
3        1503960366  4/12/2016 12:03:00 AM   0.78650      0          0
4        1503960366  4/12/2016 12:04:00 AM   0.78650      0          0
...             ...                    ...       ...    ...        ...
1325575  8877689391   5/12/2016 1:55:00 PM   1.33353      0          0
1325576  8877689391   5/12/2016 1:56:00 PM   1.33353      0          0
1325577  8877689391   5/12/2016 1:57:00 PM   1.33353      0          0
1325578  8877689391   5/12/2016 1:58:00 PM   1.33353      0          0
1325579  8877689391   5/12/2016 1:59:00 PM   1.33353      0          0

[1325580 rows x 5 columns]

## Load Dataset Minute Sleep

In [115]:
df11 = pd.read_csv("C:\Prepinsta Week-8 datasets\minuteSleep_merged.csv")

In [116]:
df11

                Id                  date  value        logId
0       1503960366  4/12/2016 2:47:30 AM      3  11380564589
1       1503960366  4/12/2016 2:48:30 AM      2  11380564589
2       1503960366  4/12/2016 2:49:30 AM      1  11380564589
3       1503960366  4/12/2016 2:50:30 AM      1  11380564589
4       1503960366  4/12/2016 2:51:30 AM      1  11380564589
...            ...                   ...    ...          ...
188516  8792009665   5/4/2016 9:59:00 AM      1  11552534115
188517  8792009665  5/4/2016 10:00:00 AM      1  11552534115
188518  8792009665  5/4/2016 10:01:00 AM      1  11552534115
188519  8792009665  5/4/2016 10:02:00 AM      1  11552534115
188520  8792009665  5/4/2016 10:03:00 AM      1  11552534115

[188521 rows x 4 columns]

## Data understanding

In [117]:
df11.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 188521 entries, 0 to 188520
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Id      188521 non-null  int64
 1   date    188521 non-null  object
 2   value   188521 non-null  int64
 3   logId   188521 non-null  int64
dtypes: int64(3), object(1)
memory usage: 5.8+ MB

In [118]:
df11.head()

           Id                  date  value        logId
0  1503960366  4/12/2016 2:47:30 AM      3  11380564589
1  1503960366  4/12/2016 2:48:30 AM      2  11380564589
2  1503960366  4/12/2016 2:49:30 AM      1  11380564589
3  1503960366  4/12/2016 2:50:30 AM      1  11380564589
4  1503960366  4/12/2016 2:51:30 AM      1  11380564589

In [119]:
df11.tail()

                Id                  date  value        logId
188516  8792009665   5/4/2016 9:59:00 AM      1  11552534115
188517  8792009665  5/4/2016 10:00:00 AM      1  11552534115
188518  8792009665  5/4/2016 10:01:00 AM      1  11552534115
188519  8792009665  5/4/2016 10:02:00 AM      1  11552534115
188520  8792009665  5/4/2016 10:03:00 AM      1  11552534115

In [120]:
df11.shape

(188521, 4)

In [121]:
df11.describe()

                 Id          value         logId
count  1.885210e+05  188521.000000  1.885210e+05
mean   4.996595e+09       1.095793  1.149611e+10
std    2.066950e+09       0.328673  6.822863e+07
min    1.503960e+09       1.000000  1.137223e+10
25%    3.977334e+09       1.000000  1.143931e+10
50%    4.702922e+09       1.000000  1.150114e+10
75%    6.962181e+09       1.000000  1.155253e+10
max    8.792010e+09       3.000000  1.161625e+10

In [122]:
df11.columns

Index(['Id', 'date', 'value', 'logId'], dtype='object')

## Data types

In [123]:
df11.dtypes

Id        int64
date     object
value     int64
logId     int64
dtype: object

## Missing values

In [124]:
df11.isna().sum()

Id       0
date     0
value    0
logId    0
dtype: int64

## Load dataset SleepDay

In [125]:
df12 = pd.read_csv("C:\Prepinsta Week-8 datasets\sleepDay_merged.csv")

In [126]:
df12

,Id,SleepDay,TotalSleepRecords,TotalMinutesAsleep,TotalTimeInBed
0,1503960366,4/12/2016 12:00:00 AM,1,327,346
1,1503960366,4/13/2016 12:00:00 AM,2,384,407
2,1503960366,4/15/2016 12:00:00 AM,1,412,442
3,1503960366,4/16/2016 12:00:00 AM,2,340,367
4,1503960366,4/17/2016 12:00:00 AM,1,700,712
...,...,...,...,...,...
408,8792009665,4/30/2016 12:00:00 AM,1,343,360
409,8792009665,5/1/2016 12:00:00 AM,1,503,527
410,8792009665,5/2/2016 12:00:00 AM,1,415,423
411,8792009665,5/3/2016 12:00:00 AM,1,516,545
412,8792009665,5/4/2016 12:00:00 AM,1,439,463

## Data Understanding

In [127]:
df12.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 413 entries, 0 to 412
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Id                  413 non-null    int64
 1   SleepDay            413 non-null    object
 2   TotalSleepRecords   413 non-null    int64
 3   TotalMinutesAsleep  413 non-null    int64
 4   TotalTimeInBed      413 non-null    int64
dtypes: int64(4), object(1)
memory usage: 16.3+ KB

In [128]:
df12.head()

,Id,SleepDay,TotalSleepRecords,TotalMinutesAsleep,TotalTimeInBed
0,1503960366,4/12/2016 12:00:00 AM,1,327,346
1,1503960366,4/13/2016 12:00:00 AM,2,384,407
2,1503960366,4/15/2016 12:00:00 AM,1,412,442
3,1503960366,4/16/2016 12:00:00 AM,2,340,367
4,1503960366,4/17/2016 12:00:00 AM,1,700,712

In [129]:
df12.tail()

,Id,SleepDay,TotalSleepRecords,TotalMinutesAsleep,TotalTimeInBed
408,8792009665,4/30/2016 12:00:00 AM,1,343,360
409,8792009665,5/1/2016 12:00:00 AM,1,503,527
410,8792009665,5/2/2016 12:00:00 AM,1,415,423
411,8792009665,5/3/2016 12:00:00 AM,1,516,545
412,8792009665,5/4/2016 12:00:00 AM,1,439,463

In [130]:
df12.describe()

                 Id  TotalSleepRecords  TotalMinutesAsleep  TotalTimeInBed
count  4.130000e+02         413.000000          413.000000      413.000000
mean   5.000979e+09           1.118644          419.467312      458.639225
std    2.060360e+09           0.345521          118.344679      127.101607
min    1.503960e+09           1.000000           58.000000       61.000000
25%    3.977334e+09           1.000000          361.000000      403.000000
50%    4.702922e+09           1.000000          433.000000      463.000000
75%    6.962181e+09           1.000000          490.000000      526.000000
max    8.792010e+09           3.000000          796.000000      961.000000

In [131]:
df12.shape

(413, 5)

In [132]:
df12.columns

Index(['Id', 'SleepDay', 'TotalSleepRecords', 'TotalMinutesAsleep',
       'TotalTimeInBed'],
      dtype='object')

## Data types

In [133]:
df12.dtypes

Id                     int64
SleepDay              object
TotalSleepRecords      int64
TotalMinutesAsleep     int64
TotalTimeInBed         int64
dtype: object

## Missing values

In [134]:
df12.isna().sum()

Id                    0
SleepDay              0
TotalSleepRecords     0
TotalMinutesAsleep    0
TotalTimeInBed        0
dtype: int64

In [135]:
df12['Id'].value_counts().count()

24

In [136]:
df12.rename(columns={'SleepDay': 'Date'}, inplace=True)

In [137]:
df12['Date'] = pd.to_datetime(df12['Date'],format='%m/%d/%Y %I:%M:%S %p')

In [138]:
df12.dtypes

Id                             int64
Date                  datetime64[ns]
TotalSleepRecords              int64
TotalMinutesAsleep             int64
TotalTimeInBed                 int64
dtype: object

## Load dataset Minute METs Narrow

In [139]:
df13= pd.read_csv("C:\Prepinsta Week-8 datasets\minuteMETsNarrow_merged.csv")

In [140]:
df13

                 Id         ActivityMinute  METs
0        1503960366  4/12/2016 12:00:00 AM    10
1        1503960366  4/12/2016 12:01:00 AM    10
2        1503960366  4/12/2016 12:02:00 AM    10
3        1503960366  4/12/2016 12:03:00 AM    10
4        1503960366  4/12/2016 12:04:00 AM    10
...             ...                    ...   ...
1325575  8877689391   5/12/2016 1:55:00 PM    11
1325576  8877689391   5/12/2016 1:56:00 PM    11
1325577  8877689391   5/12/2016 1:57:00 PM    11
1325578  8877689391   5/12/2016 1:58:00 PM    11
1325579  8877689391   5/12/2016 1:59:00 PM    11

[1325580 rows x 3 columns]

## Data Understanding

In [141]:
df13.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1325580 entries, 0 to 1325579
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   Id              1325580 non-null  int64
 1   ActivityMinute  1325580 non-null  object
 2   METs            1325580 non-null  int64
dtypes: int64(2), object(1)
memory usage: 30.3+ MB

In [142]:
df13.head()

           Id         ActivityMinute  METs
0  1503960366  4/12/2016 12:00:00 AM    10
1  1503960366  4/12/2016 12:01:00 AM    10
2  1503960366  4/12/2016 12:02:00 AM    10
3  1503960366  4/12/2016 12:03:00 AM    10
4  1503960366  4/12/2016 12:04:00 AM    10

In [143]:
df13.tail()

                 Id        ActivityMinute  METs
1325575  8877689391  5/12/2016 1:55:00 PM    11
1325576  8877689391  5/12/2016 1:56:00 PM    11
1325577  8877689391  5/12/2016 1:57:00 PM    11
1325578  8877689391  5/12/2016 1:58:00 PM    11
1325579  8877689391  5/12/2016 1:59:00 PM    11

In [144]:
df13.shape

(1325580, 3)

In [145]:
df13.describe()

                 Id          METs
count  1.325580e+06  1.325580e+06
mean   4.847898e+09  1.469001e+01
std    2.422313e+09  1.205541e+01
min    1.503960e+09  0.000000e+00
25%    2.320127e+09  1.000000e+01
50%    4.445115e+09  1.000000e+01
75%    6.962181e+09  1.100000e+01
max    8.877689e+09  1.570000e+02

In [146]:
df13.columns

Index(['Id', 'ActivityMinute', 'METs'], dtype='object')

## Data types

In [147]:
df13.dtypes

Id                 int64
ActivityMinute    object
METs               int64
dtype: object

## Missing values

In [148]:
df13.isna().sum()

Id                0
ActivityMinute    0
METs              0
dtype: int64

## Merge min_cal_step_int_merged and Minute METs Narrow

In [149]:
min_cal_step_int_MET_merged = pd.merge(min_cal_step_int_merged,df13, on=['Id','ActivityMinute'])
min_cal_step_int_MET_merged

                 Id         ActivityMinute  Calories  Steps  Intensity  METs
0        1503960366  4/12/2016 12:00:00 AM   0.78650      0          0    10
1        1503960366  4/12/2016 12:01:00 AM   0.78650      0          0    10
2        1503960366  4/12/2016 12:02:00 AM   0.78650      0          0    10
3        1503960366  4/12/2016 12:03:00 AM   0.78650      0          0    10
4        1503960366  4/12/2016 12:04:00 AM   0.78650      0          0    10
...             ...                    ...       ...    ...        ...   ...
1325575  8877689391   5/12/2016 1:55:00 PM   1.33353      0          0    11
1325576  8877689391   5/12/2016 1:56:00 PM   1.33353      0          0    11
1325577  8877689391   5/12/2016 1:57:00 PM   1.33353      0          0    11
1325578  8877689391   5/12/2016 1:58:00 PM   1.33353      0          0    11
1325579  8877689391   5/12/2016 1:59:00 PM   1.33353      0          0    11

[1325580 rows x 6 columns]

## Save min_cal_step_int_MET_merged Csv file

In [150]:
min_cal_step_int_MET_merged.to_csv("C:\PrepInsta Week-8 datasets\minuteActivity_merged.csv",index=False)

## Load dataset heartrate_seconds_merged

In [151]:
df14 = pd.read_csv("C:\Prepinsta Week-8 datasets\heartrate_seconds_merged.csv")

In [152]:
df14

                 Id                  Time  Value
0        2022484408  4/12/2016 7:21:00 AM     97
1        2022484408  4/12/2016 7:21:05 AM    102
2        2022484408  4/12/2016 7:21:10 AM    105
3        2022484408  4/12/2016 7:21:20 AM    103
4        2022484408  4/12/2016 7:21:25 AM    101
...             ...                   ...    ...
2483653  8877689391  5/12/2016 2:43:53 PM     57
2483654  8877689391  5/12/2016 2:43:58 PM     56
2483655  8877689391  5/12/2016 2:44:03 PM     55
2483656  8877689391  5/12/2016 2:44:18 PM     55
2483657  8877689391  5/12/2016 2:44:28 PM     56

[2483658 rows x 3 columns]

## Data Understanding

In [153]:
df14.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2483658 entries, 0 to 2483657
Data columns (total 3 columns):
 #   Column  Dtype
---  ------  -----
 0   Id      int64
 1   Time    object
 2   Value   int64
dtypes: int64(2), object(1)
memory usage: 56.8+ MB

In [154]:
df14.head()

           Id                  Time  Value
0  2022484408  4/12/2016 7:21:00 AM     97
1  2022484408  4/12/2016 7:21:05 AM    102
2  2022484408  4/12/2016 7:21:10 AM    105
3  2022484408  4/12/2016 7:21:20 AM    103
4  2022484408  4/12/2016 7:21:25 AM    101

In [155]:
df14.tail()

                 Id                  Time  Value
2483653  8877689391  5/12/2016 2:43:53 PM     57
2483654  8877689391  5/12/2016 2:43:58 PM     56
2483655  8877689391  5/12/2016 2:44:03 PM     55
2483656  8877689391  5/12/2016 2:44:18 PM     55
2483657  8877689391  5/12/2016 2:44:28 PM     56

In [156]:
df14.describe()

                 Id         Value
count  2.483658e+06  2.483658e+06
mean   5.513765e+09  7.732842e+01
std    1.950224e+09  1.940450e+01
min    2.022484e+09  3.600000e+01
25%    4.388162e+09  6.300000e+01
50%    5.553957e+09  7.300000e+01
75%    6.962181e+09  8.800000e+01
max    8.877689e+09  2.030000e+02

In [157]:
df14.shape

(2483658, 3)

In [158]:
df14.columns

Index(['Id', 'Time', 'Value'], dtype='object')

## Data types

In [159]:
df14.dtypes

Id        int64
Time     object
Value     int64
dtype: object

## Missing values

In [160]:
df14.isna().sum()

Id       0
Time     0
Value    0
dtype: int64

## Load dataset Weightloginfo_merged

In [161]:
df15= pd.read_csv("C:\Prepinsta Week-8 datasets\weightLogInfo_merged.csv")

In [162]:
df15

,Id,Date,WeightKg,WeightPounds,Fat,BMI,IsManualReport,LogId
0,1503960366,5/2/2016 11:59:59 PM,52.599998,115.963147,22.0,22.650000,True,1462233599000
1,1503960366,5/3/2016 11:59:59 PM,52.599998,115.963147,NaN,22.650000,True,1462319999000
2,1927972279,4/13/2016 1:08:52 AM,133.500000,294.317120,NaN,47.540001,False,1460509732000
3,2873212765,4/21/2016 11:59:59 PM,56.700001,125.002104,NaN,21.450001,True,1461283199000
4,2873212765,5/12/2016 11:59:59 PM,57.299999,126.324875,NaN,21.690001,True,1463097599000
...,...,...,...,...,...,...,...,...
62,8877689391,5/6/2016 6:43:35 AM,85.000000,187.392923,NaN,25.440001,False,1462517015000
63,8877689391,5/8/2016 7:35:53 AM,85.400002,188.274775,NaN,25.559999,False,1462692953000
64,8877689391,5/9/2016 6:39:44 AM,85.500000,188.495234,NaN,25.610001,False,1462775984000
65,8877689391,5/11/2016 6:51:47 AM,85.400002,188.274775,NaN,25.559999,False,1462949507000
66,8877689391,5/12/2016 6:42:53 AM,84.000000,185.188300,NaN,25.139999,False,1463035373000

## Data Understanding

In [163]:
df15.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67 entries, 0 to 66
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Id              67 non-null     int64
 1   Date            67 non-null     object
 2   WeightKg        67 non-null     float64
 3   WeightPounds    67 non-null     float64
 4   Fat             2 non-null      float64
 5   BMI             67 non-null     float64
 6   IsManualReport  67 non-null     bool
 7   LogId           67 non-null     int64
dtypes: bool(1), float64(4), int64(2), object(1)
memory usage: 3.9+ KB

In [164]:
df15.head()

,Id,Date,WeightKg,WeightPounds,Fat,BMI,IsManualReport,LogId
0,1503960366,5/2/2016 11:59:59 PM,52.599998,115.963147,22.0,22.650000,True,1462233599000
1,1503960366,5/3/2016 11:59:59 PM,52.599998,115.963147,NaN,22.650000,True,1462319999000
2,1927972279,4/13/2016 1:08:52 AM,133.500000,294.317120,NaN,47.540001,False,1460509732000
3,2873212765,4/21/2016 11:59:59 PM,56.700001,125.002104,NaN,21.450001,True,1461283199000
4,2873212765,5/12/2016 11:59:59 PM,57.299999,126.324875,NaN,21.690001,True,1463097599000

In [165]:
df15.tail()

,Id,Date,WeightKg,WeightPounds,Fat,BMI,IsManualReport,LogId
62,8877689391,5/6/2016 6:43:35 AM,85.000000,187.392923,NaN,25.440001,False,1462517015000
63,8877689391,5/8/2016 7:35:53 AM,85.400002,188.274775,NaN,25.559999,False,1462692953000
64,8877689391,5/9/2016 6:39:44 AM,85.500000,188.495234,NaN,25.610001,False,1462775984000
65,8877689391,5/11/2016 6:51:47 AM,85.400002,188.274775,NaN,25.559999,False,1462949507000
66,8877689391,5/12/2016 6:42:53 AM,84.000000,185.188300,NaN,25.139999,False,1463035373000

In [166]:
df15.shape

(67, 8)

In [167]:
df15.describe()

,Id,WeightKg,WeightPounds,Fat,BMI,LogId
count,6.700000e+01,67.000000,67.000000,2.00000,67.000000,6.700000e+01
mean,7.009282e+09,72.035821,158.811801,23.50000,25.185224,1.461772e+12
std,1.950322e+09,13.923206,30.695415,2.12132,3.066963,7.829948e+08
min,1.503960e+09,52.599998,115.963147,22.00000,21.450001,1.460444e+12
25%,6.962181e+09,61.400002,135.363832,22.75000,23.959999,1.461079e+12
50%,6.962181e+09,62.500000,137.788914,23.50000,24.389999,1.461802e+12
75%,8.877689e+09,85.049999,187.503152,24.25000,25.559999,1.462375e+12
max,8.877689e+09,133.500000,294.317120,25.00000,47.540001,1.463098e+12

In [168]:
df15.columns

Index(['Id', 'Date', 'WeightKg', 'WeightPounds', 'Fat', 'BMI',
       'IsManualReport', 'LogId'],
      dtype='object')

## Data types

In [169]:
df15.dtypes

Id                  int64
Date               object
WeightKg          float64
WeightPounds      float64
Fat               float64
BMI               float64
IsManualReport       bool
LogId               int64
dtype: object

## Missing values

In [170]:
df15.isna().sum()

Id                 0
Date               0
WeightKg           0
WeightPounds       0
Fat               65
BMI                0
IsManualReport     0
LogId              0
dtype: int64

## Merge Daily Activity and SleepDay

In [171]:
daily_act_slp_merged = pd.merge(df1,df12,on=['Id', 'Date'])
daily_act_slp_merged

,Id,Date,TotalSteps,TotalDistance,Calories,TotalSleepRecords,TotalMinutesAsleep,TotalTimeInBed
0,1503960366,2016-04-12,13162,8.50,1985,1,327,346
1,1503960366,2016-04-13,10735,6.97,1797,2,384,407
2,1503960366,2016-04-15,9762,6.28,1745,1,412,442
3,1503960366,2016-04-16,12669,8.16,1863,2,340,367
4,1503960366,2016-04-17,9705,6.48,1728,1,700,712
...,...,...,...,...,...,...,...,...
408,8792009665,2016-04-30,7174,4.59,2896,1,343,360
409,8792009665,2016-05-01,1619,1.04,1962,1,503,527
410,8792009665,2016-05-02,1831,1.17,2015,1,415,423
411,8792009665,2016-05-03,2421,1.55,2297,1,516,545
412,8792009665,2016-05-04,2283,1.46,2067,1,439,463

## Save daily_act_slp_merged Csv file

In [172]:
daily_act_slp_merged.to_csv("C:\PrepInsta Week-8 datasets\dailyActivity_merged(1).csv")

In [173]:
hrly_activity_merged

,Id,ActivityHour,Calories,TotalIntensity,AverageIntensity,StepTotal
0,1503960366,4/12/2016 12:00:00 AM,81,20,0.333333,373
1,1503960366,4/12/2016 1:00:00 AM,61,8,0.133333,160
2,1503960366,4/12/2016 2:00:00 AM,59,7,0.116667,151
3,1503960366,4/12/2016 3:00:00 AM,47,0,0.000000,0
4,1503960366,4/12/2016 4:00:00 AM,48,0,0.000000,0
...,...,...,...,...,...,...
22094,8877689391,5/12/2016 10:00:00 AM,126,12,0.200000,514
22095,8877689391,5/12/2016 11:00:00 AM,192,29,0.483333,1407
22096,8877689391,5/12/2016 12:00:00 PM,321,93,1.550000,3135
22097,8877689391,5/12/2016 1:00:00 PM,101,6,0.100000,307
22098,8877689391,5/12/2016 2:00:00 PM,113,9,0.150000,457